Autodesk.Revit.DB.ExternalData.CoordinationModelPositioning
Since:
2026.3
An enumerated type listing possible placement modes for linking Coordination Models.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelPositioning.BySharedCoordinates
The Coordination Model instance will be placed in Revit document by shared coordinates.

Autodesk.Revit.DB.ExternalData.CoordinationModelPositioning.OriginToInternalOrigin
The Coordination Model instance will be placed in Revit document from origin to internal origin.